#+STARTUP: indent
*** [length]
#+BEGIN_SRC emacs-lisp
(length "abc") ;3
#+END_SRC

#+RESULTS:
: 3
*** [substring]
#+BEGIN_SRC emacs-lisp
   (substring "abc123" 0 3) ;abc
  (substring "abc123" 4) ;23
  ; usage (substring "String" <From> <To>) / (substring "String"  <To>) 
  ; Position start at <From> and is default to 0 , end of <To>
#+END_SRC

#+RESULTS:
: 23

Using <C-h f> to get more info about *String Function* or see the document
[[https://www.gnu.org/software/emacs/manual/html_node/elisp/index.html][Emacs Lisp
]] [[http://xahlee.info/emacs/emacs/elisp_string_functions.html][xahlee]]
*** Scientific
#+BEGIN_SRC emacs-lisp
1e3  ;1000
#+END_SRC

#+RESULTS:
: 1000.0
*** Binary , Hex , Octal
#+BEGIN_SRC emacs-lisp
  ;expression:  #<expr>num
  #b101 
  #xef
  #o77
#+END_SRC

#+RESULTS:
: 63
*** setq
+ [(setq <var> <value>)]
+ [(setq <var1> <value1> <var2> <value2> ...)]
+ set one or more varibales. return the last value
#+BEGIN_SRC emacs-lisp
  (setq x 3)
  (setq x1 1 x2 2 x3 3)
  (message "x1=%d x2=%d x3=%d" x1 x2 x3)
#+END_SRC

#+RESULTS:
: x1=1 x2=2 x3=3
*** defvar
+ [(defvar SYMBOL &option <INITVALUE> <DOCSTRING>)]
+ define SYMBOL as a variable , and return SYMBOL
#+BEGIN_SRC emacs-lisp
  (defvar my-var 4 "这是我的变量")
  (message "my-var=%d" my-var)
#+END_SRC

#+RESULTS:
: my-var=4
*** let
+ [(let (<var1> <var2> ...) <body>)]
+ [(let VARLIST BODY)]
+ The body is one or more lisp expressions. The body's last expression's value is returned.
#+BEGIN_SRC emacs-lisp
(let (a b)
 (setq a 3)
 (setq b 4)
 (+ a b)
) ;  7
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (let ((a 3) (b 4))
    (+ a b))
#+END_SRC

#+RESULTS:
: 7

** if expression
+ [(if <test> <body>)] or [(if <test> <true body> <false body>)]
+ if <false body> is empty , <false body> is default nil
#+BEGIN_SRC emacs-lisp
          (if (< 3 2)   ;if 3 < 2
    	  (progn 8)
  	  (progn 7))
#+END_SRC

#+RESULTS:
: 7
** when expression
+ [(when <test> <expr1> <expr2> ...)]
+ campare to if expression , when expression is not else part
  #+BEGIN_SRC emacs-lisp
        (when (> 3 2)
    (setq x 3)
    (setq y 4)
    (+ x y)
          )
  #+END_SRC

  #+RESULTS:
  : 7

** cond expression
+ [(cond (<condition1> <body1>) (<condition2> <body2>) ... (t <body>)]
+ like switch , "t <body>" mean 'default'
#+BEGIN_SRC emacs-lisp
(setq ux 2)
  (cond
    ((eq ux 1) (message "ux = %d" ux))
    ((eq ux 2) (message "ux = %d" ux))
  (t (message "ux = %d")))
#+END_SRC

#+RESULTS:
: ux = 2

** Create Vector
+ [(make-vector <length> <value>)]
+ [(vector <a> <b> ...)]
+ using "[]" symbol
  
#+BEGIN_SRC emacs-lisp
  (make-vector 4 1); [1 1 1 1]
  (vector 1 2 3 4) ; [1 2 3 4]
  (setq x [1 2 "a" "b"]);[1 2 "a" "b"]
#+END_SRC

#+RESULTS:
: [1 2 "a" "b"]

*** Fill Vector
#+BEGIN_SRC emacs-lisp
  (setq x [1 2 3 4]) ; [1 2 3 4]
  (fillarray x 1) ;[1 1 1 1]
#+END_SRC

#+RESULTS:
: [1 1 1 1]
*** Change Element
+ [(aset <array> <n> <newvar>)]
#+BEGIN_SRC emacs-lisp
  (setq x [1 2 3 4])
  (aref x 2) ;3
  (aset x 2 5) ; change 3 -> 5
  (aref x 2) ;5
#+END_SRC

#+RESULTS:
: 5

